fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Up;
    patches           (airfoilUp);
    locations         faceNodes;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
      Force-Up
    );
  };
  Interface2
  {
    mesh              Fluid-Mesh-Down;
    patches           (airfoilDown);
    locations         faceNodes;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
      Force-Down
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
  nu nu [ 0 2 -1 0 0 0 0 ] 1e-03;
}
